src/Reports/ТиповаяФормаП7/ТиповаяФормаП7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ТиповаяФормаП7</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройки</name>
  </attributes>
  <attributes>
    <name>ПоказыватьБыстрыйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтрицательноеКрасным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьСоставКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПериода</name>
  </attributes>
</mdclass:Report>

src/CalculationRegisters/ОсновныеНачисленияРаботниковОрганизаций/ОсновныеНачисленияРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисленияРаботниковОрганизаций</name>
  <comment>(Регл)</comment>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоДнейЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремени</name>
    <type>
      <types>EnumRef.ВидыУчетаВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаДнейЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаЧасовЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаменыОрганизаций</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремениДляСредней</name>
    <type>
      <types>EnumRef.ВидыУчетаВремениДляСредней</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <comment>Документ, который зарегистрировал сторнируемое начисление</comment>
    <type>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ОплатаСверхурочныхЧасов</types>
      <types>DocumentRef.НачислениеПоБольничномуЛисту</types>
      <types>DocumentRef.Сторнирование</types>
      <types>DocumentRef.НевыходыВОрганизациях</types>
      <types>DocumentRef.НачислениеОтпускаРаботникамОрганизаций</types>
      <types>DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</types>
      <types>DocumentRef.ПремииРаботниковОрганизаций</types>
      <types>DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</types>
      <types>DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.ТабельУчетаРабочегоВремениОрганизации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <comment>Это либо Сотрудник, либо Внутренний совместитель, либо Сотрудник которого Заменяем</comment>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>ПерерасчетОсновныхНачислений</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
    <dimensions>
      <name>Организация</name>
    </dimensions>
    <dimensions>
      <name>Назначение</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

src/Enums/ВидыЗанятостиВОрганизации/ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCalculationTypes/ВзносыВФонды/ВзносыВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВзносыВФонды</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</baseCalculationTypes>
  <predefined>
    <items>
      <name>БезработицаГПХ20090101</name>
      <description>Безработица (ГПХ)</description>
    </items>
    <items>
      <name>Безработица20090101</name>
      <description>Безработица (работник и ГПХ)</description>
    </items>
    <items>
      <name>Безработица20050101</name>
      <description>Безработица (работник)</description>
    </items>
    <items>
      <name>БезработицаФОТ20090101</name>
      <description>Безработица (ФОТ и ГПХ)</description>
    </items>
    <items>
      <name>БезработицаФОТ20050101</name>
      <description>Безработица (ФОТ)</description>
    </items>
    <items>
      <name>ЕСВБольничные</name>
      <description>ЕСВ (больничные)</description>
    </items>
    <items>
      <name>ЕСВ</name>
      <description>ЕСВ (оплата труда)</description>
    </items>
    <items>
      <name>ЕСВГПХ</name>
      <description>ЕСВ (по договорам ГПХ)</description>
    </items>
    <items>
      <name>ЕСВФОТБольничные</name>
      <description>ЕСВ ФОТ (больничные)</description>
    </items>
    <items>
      <name>ЕСВФОТ</name>
      <description>ЕСВ ФОТ (оплата труда)</description>
    </items>
    <items>
      <name>ЕСВФОТГПХ</name>
      <description>ЕСВ ФОТ (по договорам ГПХ)</description>
    </items>
    <items>
      <name>Пенсионный20050101</name>
      <description>Пенсионный (работник)</description>
    </items>
    <items>
      <name>Пенсионный20070101</name>
      <description>Пенсионный (работник)</description>
    </items>
    <items>
      <name>ПенсионныйСДекретных20050101</name>
      <description>Пенсионный (с декретных)</description>
    </items>
    <items>
      <name>ПенсионныйФОТ20050101</name>
      <description>Пенсионный (ФОТ)</description>
    </items>
    <items>
      <name>Соцстрах20050101</name>
      <description>Соцстрах (работник)</description>
    </items>
    <items>
      <name>СоцстрахФОТ20050101</name>
      <description>Соцстрах (ФОТ)</description>
    </items>
    <items>
      <name>СоцстрахНесчФОТ20050101</name>
      <description>Соцстрах от несч. сл.(ФОТ)</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоШкале</name>
    <type>
      <types>EnumRef.СпособыРасчетаПоШкале</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаПоПериодуРегистрации</name>
    <comment>Алгоритм расчета взносов по ставке на период регистрации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/ChartsOfCalculationTypes/УдержанияОрганизаций/УдержанияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>УдержанияОрганизаций</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.УдержанияОрганизаций</baseCalculationTypes>
  <predefined>
    <items>
      <name>АлиментыПроцентом</name>
      <description>Алименты процентом</description>
    </items>
    <items>
      <name>АлиментыПроцентомДоПредела</name>
      <description>Алименты процентом до предела</description>
    </items>
    <items>
      <name>АлиментыФиксированнойСуммой</name>
      <description>Алименты фикс. суммой</description>
    </items>
    <items>
      <name>АлиментыФиксированнойСуммойДоПредела</name>
      <description>Алименты фикс. суммой до предела</description>
    </items>
    <items>
      <name>ПочтовыйСбор</name>
      <description>Почтовый сбор</description>
    </items>
    <items>
      <name>ИЛПроцентом</name>
      <description>Удержание по исп. листу процентом</description>
    </items>
    <items>
      <name>ИЛПроцентомДоПредела</name>
      <description>Удержание по исп. листу процентом до предела</description>
    </items>
    <items>
      <name>ИЛФиксированнойСуммой</name>
      <description>Удержание по исп. листу фикс. суммой</description>
    </items>
    <items>
      <name>ИЛФиксированнойСуммойДоПредела</name>
      <description>Удержание по исп. листу фикс. суммой до предела</description>
    </items>
    <items>
      <name>УдержаниеПодотчетныхДС</name>
      <description>Удержание подотчетных ДС</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаСреднегоЗаработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <type>
      <types>EnumRef.ВидыВзаиморасчетовСРаботниками</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяФормулаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСхемМотивации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиватьПриКадровыхПеремещениях</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

src/Reports/ТиповаяФормаП7/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;
перем СписокНачисленоКолонка;
перем СписокУдержаноКолонка;
Процедура ЗаполнитьПараметры(Настройки = неопределено,ЗаполнениеПоУмолчанию = Ложь) Экспорт
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
			
	конПериода =  ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("конПериода"));
	конПериода.Значение = КонецМесяца(Период);
	конПериода.Использование = Истина;
	
	начПериода =  ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("начПериода"));
	начПериода.Значение = НачалоМесяца(Период);
	начПериода.Использование = Истина;


	СледующийМесяц = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СледующийМесяц"));
	СледующийМесяц.Значение = КонецМесяца(Период) + 1;
	СледующийМесяц.Использование = Истина;

Если (Не СамостоятельнаяНастройка И СохраненнаяНастройка = Неопределено )  ИЛИ ЗаполнениеПоУмолчанию Тогда


//СПИСКИ ЗНАЧЕНИЙ
    ОсновныеНачисления = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций;
	ВзносыВФонды = ПланыВидовРасчета.ВзносыВФонды;
	УдержанияОрганизаций = ПланыВидовРасчета.УдержанияОрганизаций;
	
	списокОсновнойСотрудник = Новый СписокЗначений;
	списокОсновнойСотрудник.Добавить(Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
	списокОсновнойСотрудник.Добавить(Перечисления.ВидыЗанятостиВОрганизации.Совместительство);
	
////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////НАРАХОВАНО//////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////
	//Фонд основної заробітної плати
	//СписокНачисленоКолонка = Новый Массив(50);
	списокНачисленоКолонка[1] = Новый СписокЗначений; // тарифна ставка, посадовий оклад
	списокНачисленоКолонка[1].Добавить(ОсновныеНачисления.ОкладПоДням);
	списокНачисленоКолонка[1].Добавить(ОсновныеНачисления.ОкладПоЧасам);
	списокНачисленоКолонка[1].Добавить(ОсновныеНачисления.ТарифДневной);
	списокНачисленоКолонка[1].Добавить(ОсновныеНачисления.ТарифЧасовой);
	списокНачисленоКолонка[1].Добавить(ОсновныеНачисления.СдельнаяОплата);
	
	списокНачисленоКолонка[2] = Новый СписокЗначений; //комісійні від реалізації продукції
	списокНачисленоКолонка[2].Добавить(ОсновныеНачисления.ПустаяСсылка());

	списокНачисленоКолонка[3] = Новый СписокЗначений; // гонорар, авторська винагорода штатним працівникам
	списокНачисленоКолонка[3].Добавить(ОсновныеНачисления.АвторскоеВознаграждение);
	
	списокНачисленоКолонка[4] = Новый СписокЗначений; //оплата праці за час перебування у відрядженні
	списокНачисленоКолонка[4].Добавить(ОсновныеНачисления.ОплатаПоСреднему);
	
	списокНачисленоКолонка[5] = Новый СписокЗначений; //оплата за профнавчання інших працівників
	списокНачисленоКолонка[5].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[6] = Новый СписокЗначений; //вартість продукції, виданої працівникам при натуральній формі оплати праці 
	списокНачисленоКолонка[6].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	
	списокНачисленоКолонка[7] = Новый СписокЗначений; //інші види нарахувань
	//списокНачисленоКолонка[7].Добавить(ОсновныеНачисления.ПустаяСсылка());
	СписокНачисленоКолонка[7].Добавить(ОсновныеНачисления.ДоговорПодряда);
	СписокНачисленоКолонка[7].Добавить(ОсновныеНачисления.СдельнаяОплатаГПХ);
	
	//Фонд додаткової заробтньної плати
	списокНачисленоКолонка[8] = Новый СписокЗначений; //премія
	списокНачисленоКолонка[8].Добавить(ОсновныеНачисления.Годовая);
	списокНачисленоКолонка[8].Добавить(ОсновныеНачисления.Квартальная);
	списокНачисленоКолонка[8].Добавить(ОсновныеНачисления.Месячная);
	
	
	списокНачисленоКолонка[9] = Новый СписокЗначений; //відсоткові або комісійні винагороди
	списокНачисленоКолонка[9].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[10] = Новый СписокЗначений; //оплата роботи в надурочний час, святкові та неробочі дні
	списокНачисленоКолонка[10].Добавить(ОсновныеНачисления.ДоплатаЗаПраздничныеИВыходные);
	списокНачисленоКолонка[10].Добавить(ОсновныеНачисления.ОплатаПраздничныхИВыходных);
	
	списокНачисленоКолонка[11] = Новый СписокЗначений; //оплата днів відпочинку
	списокНачисленоКолонка[11].Добавить(ОсновныеНачисления.КомпенсацияОтпуска);
	
	
	списокНачисленоКолонка[12] = Новый СписокЗначений; //індексація заробітньої плати   
	списокНачисленоКолонка[12].Добавить(ОсновныеНачисления.ИндексацияЗарплаты);
	
	списокНачисленоКолонка[13] = Новый СписокЗначений; //компенсації працівникам у зв'язку з порушенням терміну виплати заробітньої плати
	списокНачисленоКолонка[13].Добавить(ОсновныеНачисления.КомпенсацияЗарплаты);
	
	списокНачисленоКолонка[14] = Новый СписокЗначений; //витрати на безкоштовний проїзд
	списокНачисленоКолонка[14].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[15] = Новый СписокЗначений; //вартість форменного одягу
	списокНачисленоКолонка[15].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[16] = Новый СписокЗначений; //відпустка за поточний місяць
	списокНачисленоКолонка[16].Добавить(ОсновныеНачисления.ОплатаПоСреднемуОтп);
	списокНачисленоКолонка[16].Добавить(ОсновныеНачисления.ДополнительныйЕжегодныйОтпуск);
	списокНачисленоКолонка[16].Добавить(ОсновныеНачисления.ДополнительныйОтпускНаДетей);
	списокНачисленоКолонка[16].Добавить(ОсновныеНачисления.ЧернобыльскийОтпуск);
	списокНачисленоКолонка[16].Добавить(ОсновныеНачисления.УчебныйОтпуск);
	
	списокНачисленоКолонка[17] = Новый СписокЗначений; //відпуска за наступний період
	списокНачисленоКолонка[17].Добавить(ОсновныеНачисления.ОплатаПоСреднемуОтп);
	списокНачисленоКолонка[17].Добавить(ОсновныеНачисления.ДополнительныйЕжегодныйОтпуск);
	списокНачисленоКолонка[17].Добавить(ОсновныеНачисления.ДополнительныйОтпускНаДетей);
	списокНачисленоКолонка[17].Добавить(ОсновныеНачисления.ЧернобыльскийОтпуск);
	списокНачисленоКолонка[17].Добавить(ОсновныеНачисления.УчебныйОтпуск);
		
	списокНачисленоКолонка[18] = Новый СписокЗначений; //інші нарахування за невідпрацьований час (простої, медогляд та ін.)
	списокНачисленоКолонка[18].Добавить(ОсновныеНачисления.Простой);
	списокНачисленоКолонка[18].Добавить(ОсновныеНачисления.ПростойПоСредней);
	списокНачисленоКолонка[18].Добавить(ОсновныеНачисления.ПочасовойПростой);
	списокНачисленоКолонка[18].Добавить(ОсновныеНачисления.ПочасовойПростойПоСредней);	
	
	списокНачисленоКолонка[19] = Новый СписокЗначений; //суміщення професій 
	списокНачисленоКолонка[19].Добавить(ОсновныеНачисления.ПустаяСсылка());
	                                                                   	
	списокНачисленоКолонка[20] = Новый СписокЗначений; //розширення обслуговування або збільшення обсягу робіт
	СписокНачисленоКолонка[20].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[21] = Новый СписокЗначений; //виконання обов'язків тимчасово відсутнього працівника
	списокНачисленоКолонка[21].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[22] = Новый СписокЗначений; //робота у вижких і шкідливих та особливо важких і особливо шкдливих умовах праці	
	списокНачисленоКолонка[22].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[23] = Новый СписокЗначений; //інтенсивність праці
	списокНачисленоКолонка[23].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[24] = Новый СписокЗначений; //робота в нічний час
	списокНачисленоКолонка[24].Добавить(ОсновныеНачисления.ДоплатаЗаНочныеЧасы);
	
	списокНачисленоКолонка[25] = Новый СписокЗначений; //керівництво бригадою
	списокНачисленоКолонка[25].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[26] = Новый СписокЗначений; //висока професійна майстерність
	списокНачисленоКолонка[26].Добавить(ОсновныеНачисления.ПустаяСсылка());
		
	списокНачисленоКолонка[27] = Новый СписокЗначений; //класність водіям транспортних засобів
	списокНачисленоКолонка[27].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[28] = Новый СписокЗначений; //високі досягнення праці
	списокНачисленоКолонка[28].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[29] = Новый СписокЗначений; //виконання особливо важливої роботи на певний термін
	списокНачисленоКолонка[29].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[30] = Новый СписокЗначений; //знання та використання в роботі іноземної мови
	списокНачисленоКолонка[30].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[31] = Новый СписокЗначений; //допуск до державної таємниці
	списокНачисленоКолонка[31].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[32] = Новый СписокЗначений; //дипломатичні ранги, персональні звання службових осіб, ранги державних службовців, кваліфікаційні рівні суддів
	списокНачисленоКолонка[32].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[33] = Новый СписокЗначений; //науковий ступінь
	списокНачисленоКолонка[33].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[34] = Новый СписокЗначений; //нормативний час перебвання у шахті
	списокНачисленоКолонка[34].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[35] = Новый СписокЗначений; //робота на територіях радіоактивного забруднення
	списокНачисленоКолонка[35].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[36] = Новый СписокЗначений; //інші надбавки та доплати
	списокНачисленоКолонка[36].Добавить(ОсновныеНачисления.ДоплатаЗаВечерниеЧасы);
	списокНачисленоКолонка[36].Добавить(ОсновныеНачисления.ДоплатаДоСреднего);
	списокНачисленоКолонка[36].Добавить(ОсновныеНачисления.ВыслугаЛет);
	списокНачисленоКолонка[36].Добавить(ОсновныеНачисления.ВыслугаЛетЕжемесячно);
		
	списокНачисленоКолонка[37] = Новый СписокЗначений; //інші види нарахувань
	списокНачисленоКолонка[37].Добавить(ОсновныеНачисления.ПустаяСсылка());
		
	//Інші заохочувальні та компенсаційні виплати
	списокНачисленоКолонка[38] = Новый СписокЗначений; //винагороди та заохочення, що мають одноразовий характер
	списокНачисленоКолонка[38].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[39] = Новый СписокЗначений; //матеріальна допомога, що має систематичний характер
	списокНачисленоКолонка[39].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	
	списокНачисленоКолонка[40] = Новый СписокЗначений; //виплати соціального характеру
	списокНачисленоКолонка[40].Добавить(ОсновныеНачисления.ПустаяСсылка());
	                                                                       	
	//Інші виплати, що не належать до фонду оплати праці
	
	списокНачисленоКолонка[41] = Новый СписокЗначений; //інші виплати, що не належать до фонду оплати праці
	//списокНачисленоКолонка[41].Добавить(ОсновныеНачисления.ДоговорПодряда);
	списокНачисленоКолонка[41].Добавить(ОсновныеНачисления.ДоговорПодрядаСПД);
	
	списокНачисленоКолонка[42] = Новый СписокЗначений; //допомоги та інші виплати,що здійснюються зарахунок коштів фондів державного соціального страхування
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.ОплатаБЛПоТравмеНаПроизводстве);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.ОтпускПоБеременностиИРодам);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.ПособиеПоУходуЗаРебенкомДо3Лет);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.ИндексацияСоцстрах);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.ИндексацияСоцстрахНесч);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.БлаготворительнаяПомощь);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.НаПогребение);
	списокНачисленоКолонка[42].Добавить(ОсновныеНачисления.ПриРожденииРебенка);
	
		
	списокНачисленоКолонка[43] = Новый СписокЗначений; //оплата перших 5 днів тимчасової непрацездатності за рахунок коштів підприємств 
	списокНачисленоКолонка[43].Добавить(ОсновныеНачисления.ОплатаПоСреднемуБЛОрганизации);
	
	списокНачисленоКолонка[44] = Новый СписокЗначений; //дивіденди, відсотки, виплати за паями
	списокНачисленоКолонка[44].Добавить(ОсновныеНачисления.ДивидендыРаботников);
	
	списокНачисленоКолонка[45] = Новый СписокЗначений; //витрати на відрядження
	списокНачисленоКолонка[45].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[46] = Новый СписокЗначений; //матеріальна допомога разового характеру
	СписокНачисленоКолонка[46].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[47] = Новый СписокЗначений; //внески підприємств на медичне та пенсійне страхування працівників
	списокНачисленоКолонка[47].Добавить(ОсновныеНачисления.ПустаяСсылка());
	
	списокНачисленоКолонка[48] = Новый СписокЗначений; //інші види нарахувань
	списокНачисленоКолонка[48].Добавить(ОсновныеНачисления.КомпенсацияПодотчетныхДС);
	
////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////НАРАХОВАНО//////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////	
	списокУдержаноКолонка1 = Новый СписокЗначений; //видано за 1-шу половину місяця (аванс)
	
	//Внески на загальнообов'язкове державне соціальне страхування
		
	списокУдержаноКолонка[2] = Новый СписокЗначений; //до Пенсійного фонду
	списокУдержаноКолонка[2].Добавить(ВзносыВФонды.Пенсионный20050101);
	списокУдержаноКолонка[2].Добавить(ВзносыВФонды.Пенсионный20070101);
	списокУдержаноКолонка[2].Добавить(ВзносыВФонды.ПенсионныйСДекретных20050101);
	//Пока не утвержена новая форма или комментарии - будем показывать ЕСВ здесь
	списокУдержаноКолонка[2].Добавить(ВзносыВФонды.ЕСВ);
	списокУдержаноКолонка[2].Добавить(ВзносыВФонды.ЕСВБольничные);
	списокУдержаноКолонка[2].Добавить(ВзносыВФонды.ЕСВГПХ);
	
	списокУдержаноКолонка[3] = Новый СписокЗначений; //до Фонду зайнтості
	списокУдержаноКолонка[3].Добавить(ВзносыВФонды.Безработица20050101);
	списокУдержаноКолонка[3].Добавить(ВзносыВФонды.Безработица20090101);
	списокУдержаноКолонка[3].Добавить(ВзносыВФонды.БезработицаГПХ20090101);
	
	списокУдержаноКолонка[4] = Новый СписокЗначений; //до Фонду соціального страхування з тимчасової втрати працездатності
	списокУдержаноКолонка[4].Добавить(ВзносыВФонды.Соцстрах20050101);
	
	списокУдержаноКолонка5 = Новый СписокЗначений; //податок на доходи фізичних осіб
	
	списокУдержаноКолонка[6] = Новый СписокЗначений; //профспілкові внески
	списокУдержаноКолонка[6].Добавить(УдержанияОрганизаций.ПустаяСсылка());
	
	списокУдержаноКолонка[7] = Новый СписокЗначений; //аліменти
	списокУдержаноКолонка[7].Добавить(УдержанияОрганизаций.АлиментыПроцентом);
	списокУдержаноКолонка[7].Добавить(УдержанияОрганизаций.АлиментыПроцентомДоПредела);
	списокУдержаноКолонка[7].Добавить(УдержанияОрганизаций.АлиментыФиксированнойСуммой);
	списокУдержаноКолонка[7].Добавить(УдержанияОрганизаций.АлиментыФиксированнойСуммойДоПредела);
	
	списокУдержаноКолонка8 = Новый СписокЗначений; //аванс в банк
	
	списокУдержаноКолонка9 = Новый СписокЗначений; //каса (до видачі)
	
	//ПАРАМЕТРЫ
	парамНачисленоКолонка = Новый Массив(50);
	парамУдержаноКолонка = Новый Массив(9);
	
	номер = 0;
	Пока номер < 48 Цикл
		номер = номер + 1;
		парамНачисленоКолонка[номер] = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамНачисленоКолонка" + номер));
		парамНачисленоколонка[номер].Значение = списокНачисленоКолонка[номер];
		парамНачисленоКолонка[номер].Использование = Истина;
	КонецЦикла;
	
	номер = 1;
	Пока номер < 7 Цикл
		номер = номер + 1;
		Если номер = 5 Тогда
			Продолжить;
		КонецЕсли;
		
		парамУдержаноКолонка[номер] = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамУдержаноКолонка" + номер));
		парамУдержаноколонка[номер].Значение = списокУдержаноКолонка[номер];
		парамУдержаноКолонка[номер].Использование = Истина;
	КонецЦикла
	
	КонецЕсли;

КонецПроцедуры

#Если Клиент ИЛИ ВнешнееСоединение  Тогда


Процедура ПроверитьНеучтенныеВидыРасчета() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидРасчета				КАК ВидРасчета,
	|	Сотрудник				КАК Сотрудник,
	|	ЕстьNULL(Результат,0)	КАК Результат
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	| ВидРасчета НЕ В (&парамСписок)
	| И ПериодРегистрации = &период";
	
	
	Запрос.УстановитьПараметр("парамСписок", СписокНачисленоКолонка);
	Запрос.УстановитьПараметр("период", Период);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Если Выборка.Результат <> 0 Тогда
			Сообщить("Для работника: " + Выборка.Сотрудник + " присутствует вид расчета (" + Выборка.ВидРасчета + ") с ненулевым начислением. Измените настройки!",СтатусСообщения.Важное);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

// Доработка компоновщика отчета перед выводом
//
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	Возврат;	
КонецПроцедуры

// Сохранение настроек схемы компоновки
//
Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
//
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
КонецПроцедуры

// Инициализация отчета
//
// Параметры:
//  Нет.
//
Процедура ИнициализацияОтчета() Экспорт
	
	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
	
КонецПроцедуры //ИнициализацияОтчета()


#КонецЕсли

СписокУдержаноКолонка = Новый Массив(8);
СписокНачисленоКолонка = Новый Массив(50);
